const category = {
    parentCategoryList: [
        {
            parent: "상의",
            subCategory: [
                {
                    sub: "티셔츠",
                    matchWordList: ["무지티셔츠", '스트라이프티셔츠', '레터링티셔츠', '크롭티셔츠', '캐릭터티셔츠', '반팔', '반소매']
                },
                {
                    sub: "블라우스",
                    matchWordList: ['오프숄더블라우스', '반팔블라우스']
                },
                {
                    sub: "니트",
                    matchWordList: ['라운드니트', '브이넥니트', '스퀘어넥니트', '꽈베기니트', '목폴라니트', '터틀넥니트', '니트베스트']
                },
                {
                    sub: "셔츠",
                    matchWordList: ['긴팔셔츠', '반팔셔츠', '무지셔츠', '체크셔츠', '스트라이프셔츠', '남방']
                },
                {
                    sub: "맨투맨",
                    matchWordList: ['무지맨투맨', '크롭맨투맨', '베이직맨투맨', '기모맨투맨', '스트라이프맨투맨', '배색맨투맨']
                },
                {
                    sub: "후드",
                    matchWordList: ['후드티', '후드집업']
                },
                {
                    sub: "민소매",
                    matchWordList: ['나시']
                }
            ]
        },

        {
            parent: "아우터",
            subCategory: [
                {
                    sub: "가디건",
                    matchWordList: ['숏가디건', '니트가디건', '롱가디건']
                },
                {
                    sub: "자켓",
                    matchWordList: ['트위드자켓', '가죽자켓', '무스탕', '블레이저', '퍼자켓', '청자켓', '데님자켓', '야상']
                },
                {
                    sub: "점퍼",
                    matchWordList: ['후리스', '바람막이', '아노락', '항공점퍼', '야구점퍼']
                },
                {
                    sub: "패딩",
                    matchWordList: ['롱패딩', '숏패딩', '패딩조끼', '경량패딩']
                },
                {
                    sub: "코트",
                    matchWordList: ['롱코트', '숏코트', '떡볶이코트', '싱글코트', '더블코트', '트렌치코트']
                }
            ]
        },

        {
            parent: "바지",
            subCategory: [
                {
                    sub: "반바지",
                    matchWordList: ['숏팬츠', '하이웨스트반바지', '청반바지', '면반바지']
                },
                {
                    sub: "청바지",
                    matchWordList: ['연청바지', '중청바지', '진청바지', '데님팬츠']
                },
                {
                    sub: "슬랙스",
                    matchWordList: ['와이드슬랙스', '일자슬랙스']
                },
                {
                    sub: "츄리닝바지",
                    matchWordList: ['트레이닝바지']
                }
            ]
        },

        {
            parent: "치마",
            subCategory: [
                {
                    sub: "롱스커트",
                    matchWordList: ['롱치마']
                },
                {
                    sub: "미니스커트",
                    matchWordList: ['미니치마']
                }
            ]
        },

        {
            parent: "원피스",
            subCategory: [
                {
                    sub: "미니원피스",
                    matchWordList: ['나시미니원피스', '민소매미니원피스', '체크미원피스', '스트라이프미니원피스', '셔츠미니원피스', '면미니원피스', '쉬폰미니원피스', '오프숄더미니원피스', '데님미니원피스', '린넨미니원피스', '멜빵미니원피스', '니트미니원피스']
                },
                {
                    sub: "롱원피스",
                    matchWordList: ['나시롱원피스', '민소매롱원피스', '체크롱원피스', '스트라이프롱원피스', '셔츠롱원피스', '면롱원피스', '쉬폰롱원피스', '오프숄더롱원피스', '데님롱원피스', '린넨롱원피스', '멜빵롱원피스', '니트롱원피스']
                },
                {
                    sub: "점프슈트",
                    matchWordList: []
                }
            ]
        },

        {
            parent: "뷰티",
            subCategory: [
                {
                    sub: "메이크업",
                    matchWordList: ['숏팬츠', '하이웨스트반바지', '청반바지', '면반바지']
                },
                {
                    sub: "스킨케어",
                    matchWordList: ['연청바지', '중청바지', '진청바지', '데님팬츠']
                },
                {
                    sub: "향수",
                    matchWordList: ['와이드슬랙스', '일자슬랙스']
                },
                {
                    sub: "헤어&바디",
                    matchWordList: ['염색', '머리핀', '머리끈', '헤어핀', '헤어밴드', '헤어끈']
                }
            ]
        },

        {
            parent: "악세서리",
            subCategory: [
                {
                    sub: "신발",
                    matchWordList: ['운동화', '구두', '샌들', '슬리퍼', '부츠', '로퍼', '단화', '힐', '워커', '쪼리']
                },
                {
                    sub: "모자",
                    matchWordList: ['캡모자', '비니', '볼캡', '썬캡', '밀짚모자', '귀마개', '스냅백', '야구모자', '베레모', '헌팅캡', '페도라', '반다나']
                },
                {
                    sub: "가방",
                    matchWordList: ['백팩', '숄더백', '미니백', '토트백', '크로스백', '에코백', '캔버스백', '파우치']
                },
                {
                    sub: "주얼리",
                    matchWordList: ['귀걸이', '팔찌', '목걸이', '반지', '발찌', '브로치', '귀찌']
                }
            ]
        },

        {
            parent: "라이프",
            subCategory: [
                {
                    sub: "홈웨어",
                    matchWordList: ['잠옷', '파자마', '수면양말', '양말']
                },
                {
                    sub: "가구",
                    matchWordList: ['의자', '책상', '테이블', '조명', '서랍']
                },
                {
                    sub: "가생활용품방",
                    matchWordList: ['그릇', '접시', '컵', '포크', '숟가락', '젓가락', '휴대폰', '스마트폰', '휴대폰케이스', '에어팟', '에어팟케이스', '쿠션', '이불', '베개', '인형']
                }
            ]
        }

    ]
}

module.exports = category